<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on diciembre, 13 2009 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual de Maxima: 45. descriptive</title>

<meta name="description" content="Manual de Maxima: 45. descriptive">
<meta name="keywords" content="Manual de Maxima: 45. descriptive">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: 1px solid gray;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    /* background: rgb(247,242,180); */ /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    background-color: #F1F5F9; /* light blue-gray */
    /* font-family: "Lucida Console", monospace */
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}

div.categorybox
{
    border: 1px solid gray;
    padding-top: 0px;
    padding-bottom: 0px;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,220);
}


-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="descriptive"></a>
<a name="SEC182"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_44.html#SEC181" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC183" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_44.html#SEC176" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_46.html#SEC188" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC311" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 45. descriptive </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC183">45.1 Introducci&oacute;n a descriptive</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC184">45.2 Funciones y variables para el tratamiento de datos</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC185">45.3 Funciones y variables de valores descriptivos</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC186">45.4 Funciones y variables de valores descriptivos multivariantes</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC187">45.5 Funciones y variables para gr&aacute;ficos estad&iacute;sticos</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Introducci_00f3n-a-descriptive"></a>
<a name="SEC183"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC182" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC184" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC182" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC182" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_46.html#SEC188" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC311" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 45.1 Introducci&oacute;n a descriptive </h2>


<p>El paquete <code>descriptive</code> contiene funciones para realizar 
cl'culos y gr&aacute;ficos estad&iacute;sticos descriptivos. 
Junto con el c&oacute;digo fuente se distribuyen tres conjuntos de datos: 
<code>pidigits.data</code>, <code>wind.data</code> y <code>biomed.data</code>.
</p>
<p>Cualquier manual de estad&iacute;stica se puede utilizar como referencia al paquete <code>descriptive</code>.
</p>
<p>Para comentarios, fallos y sugerencias, por favor contactar con <var>'mario AT edu DOT xunta DOT es'</var>.
</p>
<p>Aqu&iacute; un sencillo ejemplo sobre c&oacute;mo operan las funciones de <code>descriptive</code>, dependiendo de la naturaleza de sus argumentos, listas o matrices,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) /* muestra univariate */   mean ([a, b, c]);
                            c + b + a
(%o2)                       ---------
                                3
(%i3) matrix ([a, b], [c, d], [e, f]);
                            [ a  b ]
                            [      ]
(%o3)                       [ c  d ]
                            [      ]
                            [ e  f ]
(%i4) /* muestra multivariante */ mean (%);
                      e + c + a  f + d + b
(%o4)                [---------, ---------]
                          3          3
</pre>
<p>N&oacute;tese que en las muestras multivariantes la media se calcula para cada columna.
</p>
<p>En caso de varias muestras de diferente tama&ntilde;o, la funci&oacute;n <code>map</code> de Maxima puede utilizarse para obtener los resultados deseados para cada muestra,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) map (mean, [[a, b, c], [d, e]]);
                        c + b + a  e + d
(%o2)                  [---------, -----]
                            3        2
</pre>
<p>En este caso, dos muestras de tama&ntilde;os 3 y 2 han sido almacenadas en una lista.
</p>
<p>Muestras univariantes deben guardarse en listas como en
</p>
<pre class="example">(%i1) s1 : [3, 1, 4, 1, 5, 9, 2, 6, 5, 3, 5];
(%o1)           [3, 1, 4, 1, 5, 9, 2, 6, 5, 3, 5]
</pre>
<p>y muestras multivariantes en matrices como las del siguiente ejemplo
</p>
<pre class="example">(%i1) s2 : matrix ([13.17, 9.29], [14.71, 16.88], [18.50, 16.88],
             [10.58, 6.63], [13.33, 13.25], [13.21,  8.12]);
                        [ 13.17  9.29  ]
                        [              ]
                        [ 14.71  16.88 ]
                        [              ]
                        [ 18.5   16.88 ]
(%o1)                   [              ]
                        [ 10.58  6.63  ]
                        [              ]
                        [ 13.33  13.25 ]
                        [              ]
                        [ 13.21  8.12  ]
</pre>
<p>En este caso, el n&uacute;mero de columnas es igual al de la dimensi&oacute;n de la variable aleatoria y el n&uacute;mero de filas coincide con el tama&ntilde;o muestral.
</p>
<p>Los datos pueden suministrarse manualmente, pero las muestras grandes se suelen almacenar en ficheros de texto. Por ejemplo, el fichero <code>pidigits.data</code> contiene los 100 primeros d&iacute;gitos del n&uacute;mero <code>%pi</code>:
</p><pre class="example">      3
      1
      4
      1
      5
      9
      2
      6
      5
      3 ...
</pre>
<p>A fin de leer estos d&iacute;gitos desde Maxima,
</p>
<pre class="example">(%i1) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i2) length (s1);
(%o2)                          100
</pre>
<p>Por otro lado, el archivo <code>wind.data</code> contiene los promedios diarios de la velocidad del viento en cinco estaciones meteorol&oacute;gicas en Irlanda (esta muestra es parte de un conjunto de datos correspondientes a 12 estaciones meteorol&oacute;gicas. El fichero original se puede descargar libremente del 'StatLib Data Repository' y se analiza en  Haslett, J., Raftery, A. E. (1989) <var>Space-time Modelling with Long-memory Dependence: Assessing Ireland's Wind Power Resource, with Discussion</var>. Applied Statistics 38, 1-50). As&iacute; se leen los datos:
</p>
<pre class="example">(%i1) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i2) length (s2);
(%o2)                          100
(%i3) s2 [%]; /* last record */
(%o3)            [3.58, 6.0, 4.58, 7.62, 11.25]
</pre>
<p>Algunas muestras contienen datos no num&eacute;ricos. Como ejemplo, el archivo <code>biomed.data</code> (el cual es parte de otro mayor descargado tambi&eacute;n del 'StatLib Data Repository') contiene cuatro mediciones sangu&iacute;neas tomadas a dos grupos de pacientes, <code>A</code> y <code>B</code>, de diferentes edades,
</p>
<pre class="example">(%i1) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i2) length (s3);
(%o2)                          100
(%i3) s3 [1]; /* first record */
(%o3)            [A, 30, 167.0, 89.0, 25.6, 364]
</pre>
<p>El primer individuo pertenece al grupo <code>A</code>, tiene 30 a&ntilde;os de edad y sus medidas sangu&iacute;neas fueron 167.0, 89.0, 25.6 y 364.
</p>
<p>Debe tenerse cuidado cuando se trabaje con datos categ&oacute;ricos. En el siguiente ejemplo, se asigna al s&iacute;mbolo <code>a</code> cierto valor en alg&uacute;n momento previo y luego se toma una muestra con el valor categ&oacute;rico <code>a</code>,
</p>
<pre class="example">(%i1) a : 1$
(%i2) matrix ([a, 3], [b, 5]);
                            [ 1  3 ]
(%o2)                       [      ]
                            [ b  5 ]
</pre>

<hr size="6">
<a name="Funciones-y-variables-para-el-tratamiento-de-datos"></a>
<a name="SEC184"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC183" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC185" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC182" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC182" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_46.html#SEC188" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC311" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 45.2 Funciones y variables para el tratamiento de datos </h2>


<dl>
<dt><u>Funci&oacute;n:</u> <b>continuous_freq</b><i> (<var>list</var>)</i>
<a name="IDX1465"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>continuous_freq</b><i> (<var>list</var>, <var>m</var>)</i>
<a name="IDX1466"></a>
</dt>
<dd><p>El argumento de <code>continuous_freq</code> debe ser una lista de n&uacute;meros, los cuales ser&aacute;n luego agrupados en intervalos y hecho el recuento de cu&aacute;ntos hay en cada grupo. Opcionalmente, la funci&oacute;n <code>continuous_freq</code> admite un segundo argumento para indicar el n&uacute;mero de clases a considerar, siendo 10 su valor por defecto.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) continuous_freq (s1, 5);
(%o3) [[0, 1.8, 3.6, 5.4, 7.2, 9.0], [16, 24, 18, 17, 25]]
</pre>
<p>La primera lista contiene los extremos de los intervalos y la segunda los resultados de los recuentos: hay 16 d&iacute;gitos dentro del intervalo  <code>[0, 1.8]</code>, esto es ceros y unos, 24 d&iacute;gitos en <code>(1.8, 3.6]</code>, es decir doses y treses, y as&iacute; sucesivamente.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>discrete_freq</b><i> (<var>list</var>)</i>
<a name="IDX1467"></a>
</dt>
<dd><p>Calcula las frecuencias absolutas en muestras discretas, tanto num&eacute;ricas como categ&oacute;ricas. Su &uacute;nico argumento debe ser una lista.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) discrete_freq (s1);
(%o3) [[0, 1, 2, 3, 4, 5, 6, 7, 8, 9], 
                             [8, 8, 12, 12, 10, 8, 9, 8, 12, 13]]
</pre>

<p>La primera lista son los valores de la muestra y la segunda sus frecuencias absolutas. Las instrucciones <code>? col</code> y 
<code>? transpose</code> pueden ayudar a comprender la &uacute;ltima entrada.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>subsample</b><i> (<var>data_matrix</var>, <var>predicate_function</var>)</i>
<a name="IDX1468"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>subsample</b><i> (<var>data_matrix</var>, <var>predicate_function</var>, <var>col_num</var>, <var>col_num</var>, ...)</i>
<a name="IDX1469"></a>
</dt>
<dd><p>Esta es una variante de la funci&oacute;n <code>submatrix</code> de Maxima.
El primer argumento es una matriz de datos, el segundo es una 
funci&oacute;n de predicado y el resto de argumentos opcionales son
los n&uacute;meros de las columnas a tomar en consideraci&oacute;n.
</p>
<p>Estos son los registros multivariantes en los que la velocidad del viento
en la primera estaci&oacute;n meteorol&oacute;gica fue menor de 18 nudos. V&eacute;ase 
c&oacute;mo en la expresi&oacute;n lambda la <var>i</var>-&eacute;sima componente 
se la referencia como <code>v[i]</code>.
</p><pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) subsample (s2, lambda([v], v[1] &gt; 18));
              [ 19.38  15.37  15.12  23.09  25.25 ]
              [                                   ]
              [ 18.29  18.66  19.08  26.08  27.63 ]
(%o3)         [                                   ]
              [ 20.25  21.46  19.95  27.71  23.38 ]
              [                                   ]
              [ 18.79  18.96  14.46  26.38  21.84 ]
</pre>
<p>En el siguiente ejemplo, se solicitan &uacute;nicamente la primera, segunda y
quinta componentes de aquellos registros con velocidades del viento mayores
o iguales que 16 nudos en la estaci&oacute;n n&uacute;mero 1 y menores que 25 nudos
en la estaci&oacute;n n&uacute;mero 4. La muestra s&oacute;lo contiene los datos referidos
a las estaciones 1, 2 y 5. En este caso, la funci&oacute;n de predicado se
define por medio de una funci&oacute;n de Maxima ordinaria.
</p><pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) g(x):= x[1] &gt;= 16 and x[4] &lt; 25$
(%i4) subsample (s2, g, 1, 2, 5);
                     [ 19.38  15.37  25.25 ]
                     [                     ]
                     [ 17.33  14.67  19.58 ]
(%o4)                [                     ]
                     [ 16.92  13.21  21.21 ]
                     [                     ]
                     [ 17.25  18.46  23.87 ]
</pre>
<p>He aqu&iacute; un ejemplo con las variables categ&oacute;ricas de <code>biomed.data</code>.
Se piden los registros correspondientes a aquellos pacientes del grupo <code>B</code> mayores de 38 an&ntilde;os,
</p><pre class="example">(%i1) load (descriptive)$
(%i2) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i3) h(u):= u[1] = B and u[2] &gt; 38 $
(%i4) subsample (s3, h);
                [ B  39  28.0  102.3  17.1  146 ]
                [                               ]
                [ B  39  21.0  92.4   10.3  197 ]
                [                               ]
                [ B  39  23.0  111.5  10.0  133 ]
                [                               ]
                [ B  39  26.0  92.6   12.3  196 ]
(%o4)           [                               ]
                [ B  39  25.0  98.7   10.0  174 ]
                [                               ]
                [ B  39  21.0  93.2   5.9   181 ]
                [                               ]
                [ B  39  18.0  95.0   11.3  66  ]
                [                               ]
                [ B  39  39.0  88.5   7.6   168 ]
</pre>
<p>Es probable que el an&aacute;lisis estad&iacute;stico
requiera &uacute;nicamente de las medidas sangu&iacute;neas.
</p><pre class="example">(%i1) load (descriptive)$
(%i2) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i3) subsample (s3, lambda([v], v[1] = B and v[2] &gt; 38),
           3, 4, 5, 6);
                   [ 28.0  102.3  17.1  146 ]
                   [                        ]
                   [ 21.0  92.4   10.3  197 ]
                   [                        ]
                   [ 23.0  111.5  10.0  133 ]
                   [                        ]
                   [ 26.0  92.6   12.3  196 ]
(%o3)              [                        ]
                   [ 25.0  98.7   10.0  174 ]
                   [                        ]
                   [ 21.0  93.2   5.9   181 ]
                   [                        ]
                   [ 18.0  95.0   11.3  66  ]
                   [                        ]
                   [ 39.0  88.5   7.6   168 ]
</pre>
<p>Esta es la media multivariante de <code>s3</code>.
</p><pre class="example">(%i1) load (descriptive)$
(%i2) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i3) mean (s3);
       65 B + 35 A  317          6 NA + 8145.0
(%o3) [-----------, ---, 87.178, -------------, 18.123, 
           100      10                100
                                                    3 NA + 19587
                                                    ------------]
                                                        100
</pre>
<p>Aqu&iacute; la primera componente carece de significado, ya que tanto <code>A</code> como <code>B</code> son categ&oacute;ricas, la segunda componente es la edad media de los individuos en forma racional, al tiempo que los valores cuarto y quinto muestran cierto comportamiento extra&ntilde;o; lo cual se debe a que el s&iacute;mbolo <code>NA</code> se utiliza para indicar datos <i>no disponibles</i>, por lo que ambas medias no tienen sentido. Una posible soluci&oacute;n puede ser extraer de la matriz aquellas filas con s&iacute;mbolos <code>NA</code>, lo que acarrear&iacute;a cierta p&eacute;rdida de informaci&oacute;n.
</p><pre class="example">(%i1) load (descriptive)$
(%i2) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i3) g(v):= v[4] # NA and v[6] # NA $
(%i4) mean (subsample (s3, g, 3, 4, 5, 6));
(%o4) [79.4923076923077, 86.2032967032967, 16.93186813186813, 
                                                            2514
                                                            ----]
                                                             13
</pre></dd></dl>


<hr size="6">
<a name="Funciones-y-variables-de-valores-descriptivos"></a>
<a name="SEC185"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC184" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC186" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC182" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC182" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_46.html#SEC188" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC311" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 45.3 Funciones y variables de valores descriptivos </h2>


<dl>
<dt><u>Funci&oacute;n:</u> <b>mean</b><i> (<var>list</var>)</i>
<a name="IDX1470"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>mean</b><i> (<var>matrix</var>)</i>
<a name="IDX1471"></a>
</dt>
<dd><p>Es la media muestral, definida como
</p><pre class="example">                       n
                     ====
             _   1   \
             x = -    &gt;    x
                 n   /      i
                     ====
                     i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) mean (s1);
                               471
(%o3)                          ---
                               100
(%i4) %, numer;
(%o4)                         4.71
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) mean (s2);
(%o6)     [9.9485, 10.1607, 10.8685, 15.7166, 14.8441]
</pre>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>var</b><i> (<var>list</var>)</i>
<a name="IDX1472"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>var</b><i> (<var>matrix</var>)</i>
<a name="IDX1473"></a>
</dt>
<dd><p>Es la varianza muestral, definida como
</p><pre class="example">                     n
                   ====
           2   1   \          _ 2
          s  = -    &gt;    (x - x)
               n   /       i
                   ====
                   i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) var (s1), numer;
(%o3)                   8.425899999999999
</pre>
<p>V&eacute;ase tambi&eacute;n <code>var1</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>var1</b><i> (<var>list</var>)</i>
<a name="IDX1474"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>var1</b><i> (<var>matrix</var>)</i>
<a name="IDX1475"></a>
</dt>
<dd><p>Es la cuasivarianza muestral, definida como
</p><pre class="example">                     n
                   ====
               1   \          _ 2
              ---   &gt;    (x - x)
              n-1  /       i
                   ====
                   i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) var1 (s1), numer;
(%o3)                    8.5110101010101
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) var1 (s2);
(%o5) [17.39586540404041, 15.13912778787879, 15.63204924242424, 
                            32.50152569696971, 24.66977392929294]
</pre>
<p>V&eacute;ase tambi&eacute;n <code>var</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>std</b><i> (<var>list</var>)</i>
<a name="IDX1476"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>std</b><i> (<var>matrix</var>)</i>
<a name="IDX1477"></a>
</dt>
<dd><p>Es la desviaci&oacute;n t&iacute;pica muestral, ra&iacute;z cuadrada de <code>var</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) std (s1), numer;
(%o3)                   2.902740084816414
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) std (s2);
(%o5) [4.149928523480858, 3.871399812729241, 3.933920277534866, 
                            5.672434260526957, 4.941970881136392]
</pre>
<p>V&eacute;anse tambi&eacute;n <code>var</code> y <code>std1</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>std1</b><i> (<var>list</var>)</i>
<a name="IDX1478"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>std1</b><i> (<var>matrix</var>)</i>
<a name="IDX1479"></a>
</dt>
<dd><p>Es la cuasidesviaci&oacute;n t&iacute;pica muestral, ra&iacute;z cuadrada de <code>var1</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) std1 (s1), numer;
(%o3)                   2.917363553109228
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) std1 (s2);
(%o5) [4.17083509672109, 3.89090320978032, 3.953738641137555, 
                            5.701010936401517, 4.966867617451963]
</pre>
<p>V&eacute;anse tambi&eacute;n <code>var1</code> y <code>std</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>noncentral_moment</b><i> (<var>list</var>, <var>k</var>)</i>
<a name="IDX1480"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>noncentral_moment</b><i> (<var>matrix</var>, <var>k</var>)</i>
<a name="IDX1481"></a>
</dt>
<dd><p>Es el momento no central de orden <em>k</em>, definido como
</p><pre class="example">                       n
                     ====
                 1   \      k
                 -    &gt;    x
                 n   /      i
                     ====
                     i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) noncentral_moment (s1, 1), numer; /* the mean */
(%o3)                         4.71
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%o5) [319793.8724761506, 320532.1923892463, 391249.5621381556, 
                            2502278.205988911, 1691881.797742255]
(%i6) noncentral_moment (s2, 5);
</pre>
<p>V&eacute;ase tambi&eacute;n <code>central_moment</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>central_moment</b><i> (<var>list</var>, <var>k</var>)</i>
<a name="IDX1482"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>central_moment</b><i> (<var>matrix</var>, <var>k</var>)</i>
<a name="IDX1483"></a>
</dt>
<dd><p>Es el momento central de orden <em>k</em>, definido como
</p><pre class="example">                    n
                  ====
              1   \          _ k
              -    &gt;    (x - x)
              n   /       i
                  ====
                  i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) central_moment (s1, 2), numer; /* the variance */
(%o3)                   8.425899999999999
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%o5) [11.29584771375004, 16.97988248298583, 5.626661952750102, 
                             37.5986572057918, 25.85981904394192]
(%i6) central_moment (s2, 3);
</pre>
<p>V&eacute;anse tambi&eacute;n <code>central_moment</code> y <code>mean</code>.
</p></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>cv</b><i> (<var>list</var>)</i>
<a name="IDX1484"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>cv</b><i> (<var>matrix</var>)</i>
<a name="IDX1485"></a>
</dt>
<dd><p>Es el coeficiente de variaci&oacute;n, o cociente entre la desviaci&oacute;n t&iacute;pica muestral (<code>std</code>) y la media (<code>mean</code>),
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) cv (s1), numer;
(%o3)                   .6193977819764815
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) cv (s2);
(%o5) [.4192426091090204, .3829365309260502, 0.363779605385983, 
                            .3627381836021478, .3346021393989506]
</pre>
<p>V&eacute;anse tambi&eacute;n <code>std</code> y <code>mean</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>mini</b><i> (<var>list</var>)</i>
<a name="IDX1486"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>mini</b><i> (<var>matrix</var>)</i>
<a name="IDX1487"></a>
</dt>
<dd><p>Es el valor m&iacute;nimo de la muestra <var>list</var>,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) mini (s1);
(%o3)                           0
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) mini (s2);
(%o5)             [0.58, 0.5, 2.67, 5.25, 5.17]
</pre>
<p>V&eacute;ase tambi&eacute;n <code>maxi</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>maxi</b><i> (<var>list</var>)</i>
<a name="IDX1488"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>maxi</b><i> (<var>matrix</var>)</i>
<a name="IDX1489"></a>
</dt>
<dd><p>Es el valor m&aacute;ximo de la muestra <var>list</var>,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) maxi (s1);
(%o3)                           9
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) maxi (s2);
(%o5)          [20.25, 21.46, 20.04, 29.63, 27.63]
</pre>
<p>V&eacute;ase tambi&eacute;n <code>mini</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>range</b><i> (<var>list</var>)</i>
<a name="IDX1490"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>range</b><i> (<var>matrix</var>)</i>
<a name="IDX1491"></a>
</dt>
<dd><p>Es la diferencia entre los valores extremos.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) range (s1);
(%o3)                           9
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) range (s2);
(%o5)          [19.67, 20.96, 17.37, 24.38, 22.46]
</pre>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>quantile</b><i> (<var>list</var>, <var>p</var>)</i>
<a name="IDX1492"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>quantile</b><i> (<var>matrix</var>, <var>p</var>)</i>
<a name="IDX1493"></a>
</dt>
<dd><p>Es el <var>p</var>-cuantil, siendo <var>p</var> un n&uacute;mero del intervalo <em>[0, 1]</em>, de la muestra <var>list</var>.
Aunque existen varias definiciones para el cuantil muestral (Hyndman, R. J., Fan, Y. (1996) <var>Sample quantiles in statistical packages</var>. American Statistician, 50, 361-365), la programada en el paquete  <code>descriptive</code> es la basada en la interpolaci&oacute;n lineal.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) /* 1st and 3rd quartiles */
         [quantile (s1, 1/4), quantile (s1, 3/4)], numer;
(%o3)                      [2.0, 7.25]
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) quantile (s2, 1/4);
(%o5)    [7.2575, 7.477500000000001, 7.82, 11.28, 11.48]
</pre>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>median</b><i> (<var>list</var>)</i>
<a name="IDX1494"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>median</b><i> (<var>matrix</var>)</i>
<a name="IDX1495"></a>
</dt>
<dd><p>Una vez ordenada una muestra, si el tama&ntilde;o muestral es impar la mediana es el valor central, en caso contrario ser&aacute; la media de los dos valores centrales.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) median (s1);
                                9
(%o3)                           -
                                2
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) median (s2);
(%o5)         [10.06, 9.855, 10.73, 15.48, 14.105]
</pre>
<p>La mediana es el cuantil 1/2.
</p>
<p>V&eacute;ase tambi&eacute;n <code>quantile</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>qrange</b><i> (<var>list</var>)</i>
<a name="IDX1496"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>qrange</b><i> (<var>matrix</var>)</i>
<a name="IDX1497"></a>
</dt>
<dd><p>El rango intercuart&iacute;lico es la diferencia entre el tercer y primer cuartil,
<code>quantile(<var>list</var>,3/4) - quantile(<var>list</var>,1/4)</code>,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) qrange (s1);
                               21
(%o3)                          --
                               4
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) qrange (s2);
(%o5) [5.385, 5.572499999999998, 6.0225, 8.729999999999999, 
                                               6.650000000000002]
</pre>
<p>V&eacute;ase tambi&eacute;n <code>quantile</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>mean_deviation</b><i> (<var>list</var>)</i>
<a name="IDX1498"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>mean_deviation</b><i> (<var>matrix</var>)</i>
<a name="IDX1499"></a>
</dt>
<dd><p>Es la desviaci&oacute;n media, definida como
</p><pre class="example">                     n
                   ====
               1   \          _
               -    &gt;    |x - x|
               n   /       i
                   ====
                   i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) mean_deviation (s1);
                               51
(%o3)                          --
                               20
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) mean_deviation (s2);
(%o5) [3.287959999999999, 3.075342, 3.23907, 4.715664000000001, 
                                               4.028546000000002]
</pre>
<p>V&eacute;ase tambi&eacute;n <code>mean</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>median_deviation</b><i> (<var>list</var>)</i>
<a name="IDX1500"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>median_deviation</b><i> (<var>matrix</var>)</i>
<a name="IDX1501"></a>
</dt>
<dd><p>Es la desviaci&oacute;n mediana, definida como
</p><pre class="example">                 n
               ====
           1   \
           -    &gt;    |x - med|
           n   /       i
               ====
               i = 1
</pre>
<p>siendo <code>med</code> la mediana de <var>list</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) median_deviation (s1);
                                5
(%o3)                           -
                                2
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) median_deviation (s2);
(%o5)           [2.75, 2.755, 3.08, 4.315, 3.31]
</pre>
<p>V&eacute;ase tambi&eacute;n <code>mean</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>harmonic_mean</b><i> (<var>list</var>)</i>
<a name="IDX1502"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>harmonic_mean</b><i> (<var>matrix</var>)</i>
<a name="IDX1503"></a>
</dt>
<dd><p>Es la media arm&oacute;nica, definida como
</p><pre class="example">                  n
               --------
                n
               ====
               \     1
                &gt;    --
               /     x
               ====   i
               i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) y : [5, 7, 2, 5, 9, 5, 6, 4, 9, 2, 4, 2, 5]$
(%i3) harmonic_mean (y), numer;
(%o3)                   3.901858027632205
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) harmonic_mean (s2);
(%o5) [6.948015590052786, 7.391967752360356, 9.055658197151745, 
                            13.44199028193692, 13.01439145898509]
</pre>
<p>V&eacute;anse tambi&eacute;n <code>mean</code> y <code>geometric_mean</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>geometric_mean</b><i> (<var>list</var>)</i>
<a name="IDX1504"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>geometric_mean</b><i> (<var>matrix</var>)</i>
<a name="IDX1505"></a>
</dt>
<dd><p>Es la media geom&eacute;trica, definida como
</p><pre class="example">                 /  n      \ 1/n
                 | /===\   |
                 |  ! !    |
                 |  ! !  x |
                 |  ! !   i|
                 | i = 1   |
                 \         /
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) y : [5, 7, 2, 5, 9, 5, 6, 4, 9, 2, 4, 2, 5]$
(%i3) geometric_mean (y), numer;
(%o3)                   4.454845412337012
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) geometric_mean (s2);
(%o5) [8.82476274347979, 9.22652604739361, 10.0442675714889, 
                            14.61274126349021, 13.96184163444275]
</pre>
<p>V&eacute;anse tambi&eacute;n <code>mean</code> y <code>harmonic_mean</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>kurtosis</b><i> (<var>list</var>)</i>
<a name="IDX1506"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>kurtosis</b><i> (<var>matrix</var>)</i>
<a name="IDX1507"></a>
</dt>
<dd><p>Es el coeficiente de curtosis, definido como
</p><pre class="example">                    n
                  ====
            1     \          _ 4
           ----    &gt;    (x - x)  - 3
              4   /       i
           n s    ====
                  i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) kurtosis (s1), numer;
(%o3)                  - 1.273247946514421
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) kurtosis (s2);
(%o5) [- .2715445622195385, 0.119998784429451, 
   - .4275233490482866, - .6405361979019522, - .4952382132352935]
</pre>
<p>V&eacute;anse tambi&eacute;n <code>mean</code>, <code>var</code> y <code>skewness</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>skewness</b><i> (<var>list</var>)</i>
<a name="IDX1508"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>skewness</b><i> (<var>matrix</var>)</i>
<a name="IDX1509"></a>
</dt>
<dd><p>Es el coeficiente de asimetr&iacute;a, definido como
</p><pre class="example">                    n
                  ====
            1     \          _ 3
           ----    &gt;    (x - x)
              3   /       i
           n s    ====
                  i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) skewness (s1), numer;
(%o3)                  .009196180476450306
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) skewness (s2);
(%o5) [.1580509020000979, .2926379232061854, .09242174416107717, 
                            .2059984348148687, .2142520248890832]
</pre>
<p>V&eacute;anse tambi&eacute;n <code>mean</code>, <code>var</code> y <code>kurtosis</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>pearson_skewness</b><i> (<var>list</var>)</i>
<a name="IDX1510"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>pearson_skewness</b><i> (<var>matrix</var>)</i>
<a name="IDX1511"></a>
</dt>
<dd><p>Es el coeficiente de asimetr&iacute;a de Pearson, definido como
</p><pre class="example">                _
             3 (x - med)
             -----------
                  s
</pre>
<p>siendo <var>med</var> la mediana de <var>list</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) pearson_skewness (s1), numer;
(%o3)                   .2159484029093895
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) pearson_skewness (s2);
(%o5) [- .08019976629211892, .2357036272952649, 
         .1050904062491204, .1245042340592368, .4464181795804519]
</pre>
<p>V&eacute;anse tambi&eacute;n <code>mean</code>, <code>var</code> y <code>median</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>quartile_skewness</b><i> (<var>list</var>)</i>
<a name="IDX1512"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>quartile_skewness</b><i> (<var>matrix</var>)</i>
<a name="IDX1513"></a>
</dt>
<dd><p>Es el coeficiente de asimetr&iacute;a cuart&iacute;lico, definido como
</p><pre class="example">               c    - 2 c    + c
                3/4      1/2    1/4
               --------------------
                   c    - c
                    3/4    1/4
</pre>
<p>siendo <em>c_p</em> el <var>p</var>-cuantil de la muestra <var>list</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) quartile_skewness (s1), numer;
(%o3)                  .04761904761904762
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) quartile_skewness (s2);
(%o5) [- 0.0408542246982353, .1467025572005382, 
       0.0336239103362392, .03780068728522298, 0.210526315789474]
</pre>
<p>V&eacute;ase tambi&eacute;n <code>quantile</code>.
</p></dd></dl>


<hr size="6">
<a name="Funciones-y-variables-de-valores-descriptivos-multivariantes"></a>
<a name="SEC186"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC185" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC187" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC182" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC182" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_46.html#SEC188" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC311" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 45.4 Funciones y variables de valores descriptivos multivariantes </h2>


<dl>
<dt><u>Funci&oacute;n:</u> <b>cov</b><i> (<var>matrix</var>)</i>
<a name="IDX1514"></a>
</dt>
<dd><p>Es la matriz de covarianzas de una muestra multivariante, definida como
</p><pre class="example">              n
             ====
          1  \           _        _
      S = -   &gt;    (X  - X) (X  - X)'
          n  /       j        j
             ====
             j = 1
</pre>
<p>siendo <em>X_j</em> la <em>j</em>-&eacute;sima fila de la matriz muestral.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) fpprintprec : 7$  /* change precision for pretty output */
      [ 17.22191  13.61811  14.37217  19.39624  15.42162 ]
      [                                                  ]
      [ 13.61811  14.98774  13.30448  15.15834  14.9711  ]
      [                                                  ]
(%o4) [ 14.37217  13.30448  15.47573  17.32544  16.18171 ]
      [                                                  ]
      [ 19.39624  15.15834  17.32544  32.17651  20.44685 ]
      [                                                  ]
      [ 15.42162  14.9711   16.18171  20.44685  24.42308 ]
(%i5) cov (s2);
</pre>
<p>V&eacute;ase tambi&eacute;n <code>cov1</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>cov1</b><i> (<var>matrix</var>)</i>
<a name="IDX1515"></a>
</dt>
<dd><p>Es la matriz de cuasivarianzas de una muestra multivariante, definida como
</p><pre class="example">              n
             ====
         1   \           _        _
   S  = ---   &gt;    (X  - X) (X  - X)'
    1   n-1  /       j        j
             ====
             j = 1
</pre>
<p>siendo <em>X_j</em> la <em>j</em>-&eacute;sima fila de la matriz muestral.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) fpprintprec : 7$ /* change precision for pretty output */
      [ 17.39587  13.75567  14.51734  19.59216  15.5774  ]
      [                                                  ]
      [ 13.75567  15.13913  13.43887  15.31145  15.12232 ]
      [                                                  ]
(%o4) [ 14.51734  13.43887  15.63205  17.50044  16.34516 ]
      [                                                  ]
      [ 19.59216  15.31145  17.50044  32.50153  20.65338 ]
      [                                                  ]
      [ 15.5774   15.12232  16.34516  20.65338  24.66977 ]
(%i5) cov1 (s2);
</pre>
<p>V&eacute;ase tambi&eacute;n <code>cov</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>global_variances</b><i> (<var>matrix</var>)</i>
<a name="IDX1516"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>global_variances</b><i> (<var>matrix</var>, <var>logical_value</var>)</i>
<a name="IDX1517"></a>
</dt>
<dd><p>La funci&oacute;n <code>global_variances</code> devuelve una lista de medidas globales de variabilidad:
</p>
<ul>
<li>
<var>varianza total</var>: <code>trace(S_1)</code>,
</li><li>
<var>varianza media</var>: <code>trace(S_1)/p</code>,
</li><li>
<var>varianza generalizada</var>: <code>determinant(S_1)</code>,
</li><li>
<var>desviaci&oacute;n t&iacute;pica generalizada</var>: <code>sqrt(determinant(S_1))</code>,
</li><li>
<var>varianza efectiva</var> <code>determinant(S_1)^(1/p)</code>, (definida en: Pe&ntilde;a, D. (2002) <var>An&aacute;lisis de datos multivariantes</var>; McGraw-Hill, Madrid.)
</li><li>
<var>desviaci&oacute;n t&iacute;pica efectiva</var>: <code>determinant(S_1)^(1/(2*p))</code>.
</li></ul>
<p>donde <var>p</var> es la dimensi&oacute;n de la variable aleatoria multivariante y <em>S_1</em> la matriz de covarianzas devuelta por la funci&oacute;n <code>cov1</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) global_variances (s2);
(%o3) [105.338342060606, 21.06766841212119, 12874.34690469686, 
         113.4651792608502, 6.636590811800794, 2.576158149609762]
</pre>
<p>La funci&oacute;n <code>global_variances</code> tiene un argumento l&oacute;gico opcional: <code>global_variances(x,true)</code> indica a Maxima que <code>x</code> es la matriz de datos, calculando entonces lo mismo que <code>global_variances(x)</code>. Por otro lado, <code>global_variances(x,false)</code> significa que  <code>x</code> no es la matriz de datos, sino la de covarianzas, evitando as&iacute; recalcularla,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) s : cov1 (s2)$
(%i4) global_variances (s, false);
(%o4) [105.338342060606, 21.06766841212119, 12874.34690469686, 
         113.4651792608502, 6.636590811800794, 2.576158149609762]
</pre>
<p>V&eacute;anse tambi&eacute;n <code>cov</code> y <code>cov1</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>cor</b><i> (<var>matrix</var>)</i>
<a name="IDX1518"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>cor</b><i> (<var>matrix</var>, <var>logical_value</var>)</i>
<a name="IDX1519"></a>
</dt>
<dd><p>Es la matriz de correlaciones de la muestra multivariante.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) fpprintprec:7$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) cor (s2);
      [   1.0     .8476339  .8803515  .8239624  .7519506 ]
      [                                                  ]
      [ .8476339    1.0     .8735834  .6902622  0.782502 ]
      [                                                  ]
(%o4) [ .8803515  .8735834    1.0     .7764065  .8323358 ]
      [                                                  ]
      [ .8239624  .6902622  .7764065    1.0     .7293848 ]
      [                                                  ]
      [ .7519506  0.782502  .8323358  .7293848    1.0    ]
</pre>
<p>La funci&oacute;n <code>cor</code> tiene un argumento l&oacute;gico opcional: <code>cor(x,true)</code> indica a Maxima que <code>x</code> es la matriz de datos, calculando entonces lo mismo que <code>cor(x)</code>. Por otro lado, <code>cor(x,false)</code> significa que  <code>x</code> no es la matriz de datos, sino la de covarianzas, evitando as&iacute; recalcularla,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) fpprintprec:7$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) s : cov1 (s2)$
(%i5) cor (s, false); /* this is faster */
      [   1.0     .8476339  .8803515  .8239624  .7519506 ]
      [                                                  ]
      [ .8476339    1.0     .8735834  .6902622  0.782502 ]
      [                                                  ]
(%o5) [ .8803515  .8735834    1.0     .7764065  .8323358 ]
      [                                                  ]
      [ .8239624  .6902622  .7764065    1.0     .7293848 ]
      [                                                  ]
      [ .7519506  0.782502  .8323358  .7293848    1.0    ]
</pre>
<p>V&eacute;anse tambi&eacute;n <code>cov</code> y <code>cov1</code>.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>list_correlations</b><i> (<var>matrix</var>)</i>
<a name="IDX1520"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>list_correlations</b><i> (<var>matrix</var>, <var>logical_value</var>)</i>
<a name="IDX1521"></a>
</dt>
<dd><p>La funci&oacute;n <code>list_correlations</code> devuelve una lista con medidas de correlaci&oacute;n:
</p>
<ul>
<li>
<var>matriz de precisi&oacute;n</var>: es la inversa de la matriz de covarianzas <em>S_1</em>,
<pre class="example">       -1     ij
      S   = (s  )             
       1         i,j = 1,2,...,p
</pre>
</li><li>
<var>multiple correlation vector</var>:  <em>(R_1^2, R_2^2, ..., R_p^2)</em>, with 
<pre class="example">       2          1
      R  = 1 - -------
       i        ii
               s   s
                    ii
</pre><p>es un indicador de la bondad de ajuste del modelo de regresi&oacute;n lineal multivariante de <em>X_i</em> cuando el resto de variables se utilizan como regresores.
</p>
</li><li>
<var>matriz de correlaciones parciales</var>: en la que el elemento <em>(i, j)</em> es
<pre class="example">                         ij
                        s
      r        = - ------------
       ij.rest     / ii  jj\ 1/2
                   |s   s  |
                   \       /
</pre>

</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) z : list_correlations (s2)$
(%i4) fpprintprec : 5$ /* for pretty output */
      [  .38486   - .13856   - .15626   - .10239    .031179  ]
      [                                                      ]
      [ - .13856   .34107    - .15233    .038447   - .052842 ]
      [                                                      ]
(%o5) [ - .15626  - .15233    .47296    - .024816  - .10054  ]
      [                                                      ]
      [ - .10239   .038447   - .024816   .10937    - .034033 ]
      [                                                      ]
      [ .031179   - .052842  - .10054   - .034033   .14834   ]
(%o6)       [.85063, .80634, .86474, .71867, .72675]
       [  - 1.0     .38244   .36627   .49908   - .13049 ]
       [                                                ]
       [  .38244    - 1.0    .37927  - .19907   .23492  ]
       [                                                ]
(%o7)  [  .36627    .37927   - 1.0    .10911    .37956  ]
       [                                                ]
       [  .49908   - .19907  .10911   - 1.0     .26719  ]
       [                                                ]
       [ - .13049   .23492   .37956   .26719    - 1.0   ]
</pre>
<p>La funci&oacute;n <code>list_correlations</code> tiene un argumento l&oacute;gico opcional: <code>list_correlations(x,true)</code> indica a Maxima que <code>x</code> es la matriz de datos, calculando entonces lo mismo que <code>list_correlations(x)</code>. Por otro lado, <code>list_correlations(x,false)</code> significa que  <code>x</code> no es la matriz de datos, sino la de covarianzas, evitando as&iacute; recalcularla.
</p>
<p>V&eacute;anse tambi&eacute;n <code>cov</code> y <code>cov1</code>.
</p></dd></dl>


<hr size="6">
<a name="Funciones-y-variables-para-gr_00e1ficos-estad_00edsticos"></a>
<a name="SEC187"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC186" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_46.html#SEC188" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC182" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC182" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_46.html#SEC188" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC311" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 45.5 Funciones y variables para gr&aacute;ficos estad&iacute;sticos </h2>



<dl>
<dt><u>Funci&oacute;n:</u> <b>histogram</b><i> (<var>list</var>)</i>
<a name="IDX1522"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>histogram</b><i> (<var>list</var>, <var>option_1</var>, <var>option_2</var>, ...)</i>
<a name="IDX1523"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>histogram</b><i> (<var>one_column_matrix</var>)</i>
<a name="IDX1524"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>histogram</b><i> (<var>one_column_matrix</var>, <var>option_1</var>, <var>option_2</var>, ...)</i>
<a name="IDX1525"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>histogram</b><i> (<var>one_row_matrix</var>)</i>
<a name="IDX1526"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>histogram</b><i> (<var>one_row_matrix</var>, <var>option_1</var>, <var>option_2</var>, ...)</i>
<a name="IDX1527"></a>
</dt>
<dd><p>Esta funci&oacute;n dibuja el histograma de una muestra de variable continua.
Los datos muestrales se deben almacenar en una lista de n&uacute;meros o en
una matriz unidimensional.
</p>
<p>Opciones disponibles:
</p>
<ul>
<li>
Las definidas en el paquete <code>draw</code>. V&eacute;anse tambi&eacute;n <code>bars</code> y <code>barsplot</code>.
</li><li>
<var>nclasses</var>: n&uacute;mero de clases del histograma (por defecto, 10).
</li></ul>

<p>V&eacute;anse tambi&eacute;n <code>discrete_freq</code> y <code>continuous_freq</code> para recuentos,
y <code>bars</code> y <code>barsplot</code> para representar gr&aacute;ficos.
</p>
<p>Ejemplos:
</p>
<p>Un histograma de ocho clases.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) histogram (
     s1,
     nclasses     = 8,
     title        = &quot;pi digits&quot;,
     xlabel       = &quot;digits&quot;,
     ylabel       = &quot;Absolute frequency&quot;,
     fill_color   = grey,
     fill_density = 0.6)$
</pre></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>scatterplot</b><i> (<var>list</var>)</i>
<a name="IDX1528"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>scatterplot</b><i> (<var>list</var>, <var>option_1</var>, <var>option_2</var>, ...)</i>
<a name="IDX1529"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>scatterplot</b><i> (<var>matrix</var>)</i>
<a name="IDX1530"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>scatterplot</b><i> (<var>matrix</var>, <var>option_1</var>, <var>option_2</var>, ...)</i>
<a name="IDX1531"></a>
</dt>
<dd><p>Dibuja diagramas de dispersi&oacute;n, tanto de muestras univariantes (<var>list</var>)
como multivariantes (<var>matrix</var>). 
</p>
<p>Opciones disponibles:
</p>
<ul>
<li>
Las definidas en el paquete <code>draw</code>.
</li><li>
<var>nclasses</var>: n&uacute;mero de clases del histograma (por defecto, 10).
</li></ul>

<p>Ejemplos:
</p>
<p>Diagrama de dispersi&oacute;n univariante a partir de una muestra normal
simulada. 
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (distrib)$
(%i3) scatterplot(
  random_normal(0,1,200),
  xaxis      = true,
  point_size = 2,
  terminal   = eps,
  eps_width  = 10,
  eps_height = 2)$
</pre>
<p>Diagrama de dispersi&oacute;n bidimensional.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) scatterplot(
 submatrix(s2, 1,2,3),
 title      = &quot;Data from stations #4 and #5&quot;,
 point_type = diamant,
 point_size = 2,
 color      = blue)$
</pre>
<p>Diagrama de dispersi&oacute;n tridimensional.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) scatterplot(submatrix (s2, 1,2))$
</pre>
<p>Diagrama de dispersi&oacute;n de cinco dimensiones, con histogramas de
cinco classes.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) scatterplot(
  s2,
  nclasses     = 5,
  fill_color   = blue,
  fill_density = 0.3,
  xtics        = 5)$
</pre>
<p>Para dibujar puntos aislados o unidos por segmentos, tanto en dos
como en tres dimensiones, v&eacute;ase <code>points</code>.
Para las opciones relacionadas con los histogramas, v&eacute;ase <code>bars</code>.
</p>
<p>V&eacute;ase tambi&eacute;n <code>histogram</code>.
</p></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>barsplot</b><i> (<var>data1</var>, <var>data2</var>, ..., <var>option_1</var>, <var>option_2</var>, ...)</i>
<a name="IDX1532"></a>
</dt>
<dd><p>Dibuja diagramas de barras para variables estad&iacute;sticas
discretas, tanto para una como para m&aacute;s muestras.
</p>
<p><var>data</var> puede ser una lista de resultados provenientes de una muestra
o una matriz de <var>m</var> filas y <var>n</var> columnas, representando <var>n</var> 
muestras de tama&ntilde;o <var>m</var> cada una.
</p>
<p>Las opciones disponibles son:
</p>
<ul>
<li>
Las definidas en el paquete <code>draw</code>.
</li><li>
<var>box_width</var>: ancho relativo de los rect&aacute;ngulos (<code>3/4</code> por defecto). Este 
valor debe pertenecer al rango <code>[0,1]</code>.

</li><li>
<var>groups_gap</var>: un n&uacute;mero positivo que representa la separaci&oacute;n entre
dos grupos consecutivos de barras. El valor por defecto es 1.

</li><li>
<var>bars_colors</var>: una lista de colores para m&uacute;ltiples muestras. El valor
por defecto es la lista vac&iacute;a <code>[]</code>. Cuando el n&uacute;mero de
muestras sea mayor que el de colores especificados, los colores adicionales
necesarios se seleccionan aleatoriamente. V&eacute;ase <code>color</code> para m&aacute;s
informaci&oacute;n.

</li><li>
<var>relative_frequencies</var>: si vale <code>false</code>, se utilizar&aacute;n frecuencias
absolutas; si vale <code>true</code>, las marcas del eje-<var>y</var> ser&aacute;n frecuencias
relativas. El valor por defecto es <code>false</code>.

</li><li>
<var>ordering</var>: los valores admitidos para esta opci&oacute;n son: <code>orderlessp</code>
y <code>ordergreatp</code>, indicando c&oacute;mo se deben ordenar los resultados muestrales
sobre el eje-<var>x</var>. El valor por defecto es <code>orderlessp</code>.

</li><li>
<var>sample_keys</var>: es una lista de cadenas de texto a usar como leyendas.
Su valor por defecto es la lista vac&iacute;a <code>[]</code>.
Cuando la lista tenga una longitud diferente de cero o del n&uacute;mero de muestras,
se devolver&aacute; un mensaje de error.

</li></ul>

<p>Ejemplos:
</p>
<p>Muestra univariante en formato matricial. Frecuencias absolutas.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) m : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i3) barsplot(
        col(m,2),
        title        = &quot;Ages&quot;,
        xlabel       = &quot;years&quot;,
        box_width    = 1/2,
        fill_density = 3/4)$
</pre>
<p>Dos muestras de diferente tama&ntilde;o, con frecuencias
relativas y colores definidos por el usuario.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) l1:makelist(random(10),k,1,50)$
(%i3) l2:makelist(random(10),k,1,100)$
(%i4) barsplot(
        l1,l2,
        box_width    = 1,
        fill_density = 1,
        bars_colors  = [black, grey],
        relative_frequencies = true,
        sample_keys = [&quot;A&quot;, &quot;B&quot;])$
</pre>
<p>Cuatro muestras no num&eacute;ricas de igual tama&ntilde;o.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) barsplot(
        makelist([Yes, No, Maybe][random(3)+1],k,1,50),
        makelist([Yes, No, Maybe][random(3)+1],k,1,50),
        makelist([Yes, No, Maybe][random(3)+1],k,1,50),
        makelist([Yes, No, Maybe][random(3)+1],k,1,50),
        title  = &quot;Asking for something to four groups&quot;,
        ylabel = &quot;# of individuals&quot;,
        groups_gap   = 3,
        fill_density = 0.5,
        ordering     = ordergreatp)$
</pre>
<p><code>barsplot</code> en un contexto multiplot.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) l1:makelist(random(10),k,1,50)$
(%i3) l2:makelist(random(10),k,1,100)$
(%i4) draw_compound : false $
(%i5) bp1 : 
        barsplot(
         l1,
         box_width = 1,
         fill_density = 0.5,
         bars_colors = [blue],
         relative_frequencies = true)$
(%i6) bp2 : 
        barsplot(
         l2,
         box_width = 1,
         fill_density = 0.5,
         bars_colors = [red],
         relative_frequencies = true)$
(%i7) draw(apply(gr2d,bp1), 
           apply(gr2d,bp2)) $
</pre>
<p>Para las opciones relacionadas con los diagramas de barras, v&eacute;ase <code>bars</code>
del paquete <code>draw</code>.
</p>
<p>V&eacute;anse tambi&eacute;n las funciones <code>histogram</code> y <code>piechart</code>.
</p></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>piechart</b><i> (<var>list</var>)</i>
<a name="IDX1533"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>piechart</b><i> (<var>list</var>, <var>option_1</var>, <var>option_2</var>, ...)</i>
<a name="IDX1534"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>piechart</b><i> (<var>one_column_matrix</var>)</i>
<a name="IDX1535"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>piechart</b><i> (<var>one_column_matrix</var>, <var>option_1</var>, <var>option_2</var>, ...)</i>
<a name="IDX1536"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>piechart</b><i> (<var>one_row_matrix</var>)</i>
<a name="IDX1537"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>piechart</b><i> (<var>one_row_matrix</var>, <var>option_1</var>, <var>option_2</var>, ...)</i>
<a name="IDX1538"></a>
</dt>
<dd><p>Similar a <code>barsplot</code>, pero dibuja sectores en lugar de rect&aacute;ngulos.
</p>
<p>Opciones disponibles:
</p>
<ul>
<li>
Las definidas en el paquete <code>draw</code>.
</li><li>
<var>pie_center</var>: centro del diagrama (por defecto, <code>[0,0]</code>).
</li><li>
<var>pie_radius</var>: radio del diagrama (por defecto, 1).
</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) piechart(
  s1,
  xrange      = [-1.1, 1.3],
  yrange      = [-1.1, 1.1],
  axis_top    = false,
  axis_right  = false,
  axis_left   = false,
  axis_bottom = false,
  xtics       = none,
  ytics       = none,
  title       = &quot;Digit frequencies in pi&quot;)$
</pre>
<p>V&eacute;ase tambi&eacute;n la funci&oacute;n <code>barsplot</code>.
</p></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>boxplot</b><i> (<var>data</var>)</i>
<a name="IDX1539"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>boxplot</b><i> (<var>data</var>, <var>option_1</var>, <var>option_2</var>, ...)</i>
<a name="IDX1540"></a>
</dt>
<dd><p>Dibuja diagramas de cajas (box-and-whishker). El argumento <var>data</var> puede
ser una lista, lo cual no es de gran inter&eacute;s, puesto que estos gr&aacute;ficos 
se utilizan principalmente para comparar distintas muestras, o una matriz,
de manera que sea posible comparar dos o m&aacute;s componentes de una muestra
multivariante. Tambi&eacute;n se permite que <var>data</var> sea una lista de muestras
con posibles tama&ntilde;os diferentes; de hecho, esta es la &uacute;nica funci&oacute;n
del paquete <code>descriptive</code> que admite esta estructura de datos.
</p>
<p>Opciones disponibles:
</p>
<ul>
<li>
Las definidas en el paquete <code>draw</code>.
</li><li>
<var>box_width</var>: ancho relativo de las cajas (por defecto, <code>3/4</code>). Este
valor debe estar en el rango <code>[0,1]</code>.
</li></ul>

<p>Ejemplos:
</p>
<p>Diagrama de cajas de una muestra multivariante.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix(file_search(&quot;wind.data&quot;))$
(%i3) boxplot(s2,
  box_width  = 0.2,
  title      = &quot;Windspeed in knots&quot;,
  xlabel     = &quot;Stations&quot;,
  color      = red,
  line_width = 2)$
</pre>
<p>Diagrama de cajas de tres muestras de tama&ntilde;os diferentes.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) A :
 [[6, 4, 6, 2, 4, 8, 6, 4, 6, 4, 3, 2],
  [8, 10, 7, 9, 12, 8, 10],
  [16, 13, 17, 12, 11, 18, 13, 18, 14, 12]]$
(%i3) boxplot (A)$
</pre></dd></dl>


<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC182" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_46.html#SEC188" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC311" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert Dodier</em> on <em>diciembre, 13 2009</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
